miro-kostadinov/tmos/5.05.1.0/hardware/tm4c/gpio_tm4c.h
/*
 * gpio_tm4c.h
 *
 *  Created on: Aug 26, 2014
 *      Author: miro
 */

#ifndef GPIO_TM4C_H_
#define GPIO_TM4C_H_

#include <mcu_inc.h>
#include <tmos_types.h>

/*******************************************************************************
 *  General-Purpose Input/Outputs (GPIOs)
 ******************************************************************************/
struct GPIO_TypeDef
{
	__IO uint32_t GPIODATA[256];  //!< (gpio: 0x000) GPIO Data
	__IO uint32_t GPIODIR;        //!< (gpio: 0x400) GPIO Direction
	__IO uint32_t GPIOIS;         //!< (gpio: 0x404) GPIO Interrupt Sense
	__IO uint32_t GPIOIBE;        //!< (gpio: 0x408) GPIO Interrupt Both Edges
	__IO uint32_t GPIOIEV;        //!< (gpio: 0x40C) GPIO Interrupt Event
	__IO uint32_t GPIOIM;         //!< (gpio: 0x410) GPIO Interrupt Mask
	__I  uint32_t GPIORIS;        //!< (gpio: 0x414) GPIO Raw Interrupt Status
	__I  uint32_t GPIOMIS;        //!< (gpio: 0x418) GPIO Masked Interrupt Status
	__O  uint32_t GPIOICR;        //!< (gpio: 0x41C) GPIO Interrupt Clear
	__IO uint32_t GPIOAFSEL;      //!< (gpio: 0x420) GPIO Alternate Function Select
		 uint32_t reserved1[55];  //!< (gpio: 0x424)
	__IO uint32_t GPIODR2R;       //!< (gpio: 0x500) GPIO 2-mA Drive Select
	__IO uint32_t GPIODR4R;       //!< (gpio: 0x504) GPIO 4-mA Drive Select
	__IO uint32_t GPIODR8R;       //!< (gpio: 0x508) GPIO 8-mA Drive Select
	__IO uint32_t GPIOODR;        //!< (gpio: 0x50C) GPIO Open Drain Select
	__IO uint32_t GPIOPUR;        //!< (gpio: 0x510) GPIO Pull-Up Select
	__IO uint32_t GPIOPDR;        //!< (gpio: 0x514) GPIO Pull-Down Select
	__IO uint32_t GPIOSLR;        //!< (gpio: 0x518) GPIO Slew Rate Control Select
	__IO uint32_t GPIODEN;        //!< (gpio: 0x51C) GPIO Digital Enable
	__IO uint32_t GPIOLOCK;       //!< (gpio: 0x520) GPIO Lock
	__IO uint32_t GPIOCR;         //!< (gpio: 0x524) GPIO Commit
	__IO uint32_t GPIOAMSEL;      //!< (gpio: 0x528) GPIO Analog Mode Select
	__IO uint32_t GPIOPCTL;       //!< (gpio: 0x52C) GPIO Port Control

	__IO uint32_t GPIOADCCTL; 	  //!< (gpio: 0x530) GPIO ADC Control
	__IO uint32_t GPIODMACTL; 	  //!< (gpio: 0x534) GPIO DMA Control
	__IO uint32_t GPIOSI; 		  //!< (gpio: 0x538) GPIO Select Interrupt
	__IO uint32_t GPIODR12R; 	  //!< (gpio: 0x53C) GPIO 12-mA Drive Select
	__IO uint32_t GPIOWAKEPEN; 	  //!< (gpio: 0x540) GPIO Wake Pin Enable
	__IO uint32_t GPIOWAKELVL; 	  //!< (gpio: 0x544) GPIO Wake Level
	__I  uint32_t GPIOWAKESTAT;   //!< (gpio: 0x548) GPIO Wake Status
		 uint32_t reserved2[669]; //!< (gpio: 0x54C)
	__I  uint32_t GPIOPP; 		  //!< (gpio: 0xFC0) GPIO Peripheral Property
	__IO uint32_t GPIOPC; 		  //!< (gpio: 0xFC4) GPIO Peripheral Configuration
	     uint32_t reserved3[2];   //!< (gpio: 0xFC8)
 	__I  uint32_t GPIOPeriphID4[4];  //!< (gpio: 0xFD0) GPIO Peripheral Identification 4-7
	__I  uint32_t GPIOPeriphID0[4];  //!< (gpio: 0xFE0) GPIO Peripheral Identification 0-3
	__I  uint32_t GPIOPCellID[4];    //!< (gpio: 0xFF0) GPIO PrimeCell Identification 0-3
  };

/*******************************************************************************
 * @defgroup GPIO_regs_define
 * @{
 ******************************************************************************/

/** @defgroup GPIOLOCK:		(gpio: 0x520) GPIO Lock						      */
#define GPIO_GPIOLOCK_LOCK				0x00000001 		//!< GPIO Lock
#define GPIO_GPIOLOCK_KEY				0x4C4F434B 		//!< GPIO Lock key
/** @} */

/** @} */ // @defgroup GPIO_regs_define

/*******************************************************************************
 * @defgroup STD_PIO Standard PIO definitions
 * @{
 ******************************************************************************/

/** Pin set **/
typedef unsigned char pio_set;

/** Pin definition **/
typedef unsigned int pio_def;

/** Pin configuration **/
typedef unsigned int PIN_DESC;


/// Pin definition bits 31:24 = pin set
#define PD_PINS_Pos			24						//!< pins bits position
#define PD_PINS_Msk			(0xFF << PD_PINS_Pos)	//!< pins bits mask
#define PD_PINS_Get(x)		((x) >> PD_PINS_Pos)	//!< pins value
#define PD_PIN_0			(0x01 << PD_PINS_Pos)	//!< pin 0
#define PD_PIN_1			(0x02 << PD_PINS_Pos)	//!< pin 1
#define PD_PIN_2			(0x04 << PD_PINS_Pos)	//!< pin 2
#define PD_PIN_3			(0x08 << PD_PINS_Pos)	//!< pin 3
#define PD_PIN_4			(0x10 << PD_PINS_Pos)	//!< pin 4
#define PD_PIN_5			(0x20 << PD_PINS_Pos)	//!< pin 5
#define PD_PIN_6			(0x40 << PD_PINS_Pos)	//!< pin 6
#define PD_PIN_7			(0x80 << PD_PINS_Pos)	//!< pin 7

/// Pin definition bits 23:22 = pin strength
#define PD_STRENGTH_Pos 	22						//!< strength bits position
#define PD_STRENGTH_Msk		(0x3 << PD_STRENGTH_Pos)//!< strength bits mask
#define PD_STRENGTH_Get(x)	(0x3 & ((x) >> PD_STRENGTH_Pos)) //!< strength mask
#define PD_STRENGTH_2MA     (0 << PD_STRENGTH_Pos)	//!< 2mA drive strength
#define PD_STRENGTH_4MA     (1 << PD_STRENGTH_Pos)	//!< 4mA drive strength
#define PD_STRENGTH_8MA     (2 << PD_STRENGTH_Pos)  //!< 8mA drive strength

/// Pin definition bit 21 = slew rate
#define PD_SLEW_RATE		(1 << 21)

/// Pin definition bits 20:16 = port
#define PD_PORT_Pos			16						//!< port bits position
#define PD_PORT_Msk			(0x1F << PD_PORT_Pos)	//!< port bits mask
#define PD_PORT_Get(x)		(0x1F & ((x) >> PD_PORT_Pos)) //!< port value
#define	PD_PORT_A			((unsigned int)0 << PD_PORT_Pos)		//!< port A
#define	PD_PORT_B			((unsigned int)1 << PD_PORT_Pos)		//!< port B
#define	PD_PORT_C			((unsigned int)2 << PD_PORT_Pos)		//!< port C
#define	PD_PORT_D			((unsigned int)3 << PD_PORT_Pos)		//!< port D
#define	PD_PORT_E			((unsigned int)4 << PD_PORT_Pos)		//!< port E
#define	PD_PORT_F			((unsigned int)5 << PD_PORT_Pos)		//!< port F
#define	PD_PORT_G			((unsigned int)6 << PD_PORT_Pos)		//!< port G
#define	PD_PORT_H			((unsigned int)7 << PD_PORT_Pos)		//!< port H
#define	PD_PORT_J			((unsigned int)8 << PD_PORT_Pos)		//!< port J
#define	PD_PORT_K			((unsigned int)9 << PD_PORT_Pos)		//!< port K
#define	PD_PORT_L			((unsigned int)10 << PD_PORT_Pos)		//!< port L
#define	PD_PORT_M			((unsigned int)11 << PD_PORT_Pos)		//!< port M
#define	PD_PORT_N			((unsigned int)12 << PD_PORT_Pos)		//!< port N
#define	PD_PORT_P			((unsigned int)13 << PD_PORT_Pos)		//!< port P
#define	PD_PORT_Q			((unsigned int)14 << PD_PORT_Pos)		//!< port Q
#define PD_PORT_V           ((unsigned int)0xF << PD_PORT_Pos)	//!< virtual port V
#define PD_LAST_PORT		14						//!< number of physical ports

/// Pin definition bits 15:12 = pin mux
#define PD_MUX_Pos			12						//!< mux bits position
#define PD_MUX_Msk			(0xF << PD_MUX_Pos)		//!< mux bits mask
#define PD_MUX_Get(x)		(0xF & ((x) >> PD_MUX_Pos)) //!< mux value
#define PD_MUX_0			(0 << PD_MUX_Pos)		//!< mux configuration 0
#define PD_MUX_1			(1 << PD_MUX_Pos)		//!< mux configuration 1
#define PD_MUX_2			(2 << PD_MUX_Pos)		//!< mux configuration 2
#define PD_MUX_3			(3 << PD_MUX_Pos)		//!< mux configuration 3
#define PD_MUX_4			(4 << PD_MUX_Pos)		//!< mux configuration 4
#define PD_MUX_5			(5 << PD_MUX_Pos)		//!< mux configuration 5
#define PD_MUX_6			(6 << PD_MUX_Pos)		//!< mux configuration 6
#define PD_MUX_7			(7 << PD_MUX_Pos)		//!< mux configuration 7
#define PD_MUX_8			(8 << PD_MUX_Pos)		//!< mux configuration 8
#define PD_MUX_9			(9 << PD_MUX_Pos)		//!< mux configuration 9
#define PD_MUX_10			(10 << PD_MUX_Pos)		//!< mux configuration 10
#define PD_MUX_11			(11 << PD_MUX_Pos)		//!< mux configuration 11
#define PD_MUX_12			(12 << PD_MUX_Pos)		//!< mux configuration 12
#define PD_MUX_13			(13 << PD_MUX_Pos)		//!< mux configuration 13
#define PD_MUX_14			(14 << PD_MUX_Pos)		//!< mux configuration 14
#define PD_MUX_15			(15 << PD_MUX_Pos)		//!< mux configuration 15

/// Pin definition bits 11:8 = pin mode
#define PD_MODE_Pos 		8						//!< mode bits position
#define PD_MODE_Msk			(0xF << PD_MODE_Pos)	//!< mode bits mask
#define PD_MODE_Get(x)		(0xF & ((x) >> PD_MODE_Pos)) //!< mode value
#define PD_MODE_ANALOG		(0 << PD_MODE_Pos)		//!< enable analog mode
#define PD_PUSH_PULL  		(1 << PD_MODE_Pos)		//!< standard push pull mode
#define PD_MODE_OD        	(2 << PD_MODE_Pos)		//!< open drain mode
#define PD_PULL_UP   		(4 << PD_MODE_Pos)		//!< weak pull up
#define PD_PULL_DOWN   		(8 << PD_MODE_Pos)		//!< weak pull down

