miro-kostadinov/tmos/5.05.1.0/hardware/tm4c/gpio_tm4c.h
/// Pin definition bit 7 = direction
#define PD_INPUT        	(0 << 7)				//!< input pin
#define PD_OUTPUT       	(1 << 7)				//!< output pin

/// Pin definition bit 6 = peripheral
#define PD_AFSEL 		    (1 << 6)

/// Pin definition bits 5:3 = interrupts
#define PD_INT_Pos 			3						//!< interrupt bits position
#define PD_INT_ENABLE		(1 << PD_INT_Pos)		//!< interrupt enabled
#define PD_INT_SENSE		(2 << PD_INT_Pos)		//!< sense - level or edge
#define PD_INT_BE			(4 << PD_INT_Pos)		//!< both edges
#define PD_INT_EVENT		(8 << PD_INT_Pos)		//!< high/low level or rising/falling

/// Pin definition bit 2 = Lock
#define PD_LOCK     	  	(1 << 2)

#define PD_FALLING_EDGE     (PD_INT_ENABLE)			//!< interrupt on falling edge
#define PD_RISING_EDGE      (PD_INT_ENABLE | PD_INT_EVENT)	//!< interrupt on rising edge
#define PD_BOTH_EDGES       (PD_INT_ENABLE | PD_INT_BE)	//!< interrupt on any edge
#define PD_LOW_LEVEL        (PD_INT_ENABLE | PD_INT_SENSE) //!< interrupt on low level
#define PD_HIGH_LEVEL       (PD_INT_ENABLE | PD_INT_SENSE | PD_INT_EVENT) //!< interrupt on high level

/// Pin definition bit 1 = Active level
#define PD_ACTIVE_HIGH 	  	(1 << 1)
#define PD_ACTIVE_LOW 	  	(0 << 1)

//*****************************************************************************
//
// Values that can be passed to Pin_Configure, Pin_Write, Pin_Read as the PIN_DESC parameter.
//
//*****************************************************************************

// GPIO pin A0
#define PD_PA0				(PD_PORT_A | PD_PIN_0 | PD_MUX_0)  //!< PA0
#define PD_PA0_U0RX         (PD_PORT_A | PD_PIN_0 | PD_MUX_1)  //!< PA0 as U0RX
#define PD_PA0_I2C9SCL      (PD_PORT_A | PD_PIN_0 | PD_MUX_2)  //!< PA0_as I2C9SCL
#define PD_PA0_T0CCP0       (PD_PORT_A | PD_PIN_0 | PD_MUX_3)  //!< PA0 as T0CCP0
#define PD_PA0_CAN0Rx       (PD_PORT_A | PD_PIN_0 | PD_MUX_7)  //!< PA0 as CAN0Rx

// GPIO pin A1
#define PD_PA1				(PD_PORT_A | PD_PIN_1 | PD_MUX_0)  //!< PA1
#define PD_PA1_U0Tx         (PD_PORT_A | PD_PIN_1 | PD_MUX_1)  //!< PA1 as U0TX
#define PD_PA1_I2C9SDA      (PD_PORT_A | PD_PIN_1 | PD_MUX_2)  //!< PA1 as I2C9SDA
#define PD_PA1_T0CCP1       (PD_PORT_A | PD_PIN_1 | PD_MUX_3)  //!< PA1 as T0CCP1
#define PD_PA1_CAN0Tx       (PD_PORT_A | PD_PIN_1 | PD_MUX_7)  //!< PA1 as CAN0Tx

// GPIO pin A2
#define PD_PA2				(PD_PORT_A | PD_PIN_2 | PD_MUX_0)  //!< PA2
#define PD_PA2_U4Rx         (PD_PORT_A | PD_PIN_2 | PD_MUX_1)  //!< PA2 as U4Rx
#define PD_PA2_I2C8SCL      (PD_PORT_A | PD_PIN_2 | PD_MUX_2)  //!< PA2 as I2C8SCL
#define PD_PA2_T1CCP0       (PD_PORT_A | PD_PIN_2 | PD_MUX_3)  //!< PA2 as T1CCP0
#define PD_PA2_SSI0Clk      (PD_PORT_A | PD_PIN_2 | PD_MUX_15) //!< PA2 as SSI0Clk

// GPIO pin A3
#define PD_PA3				(PD_PORT_A | PD_PIN_3 | PD_MUX_0)  //!< PA3
#define PD_PA3_U4Tx         (PD_PORT_A | PD_PIN_3 | PD_MUX_1)  //!< PA3 as U4Tx
#define PD_PA3_I2C8SDA      (PD_PORT_A | PD_PIN_3 | PD_MUX_2)  //!< PA3 as I2C8SDA
#define PD_PA3_T1CCP1       (PD_PORT_A | PD_PIN_3 | PD_MUX_3)  //!< PA3 as T1CCP1
#define PD_PA3_SSI0Fss      (PD_PORT_A | PD_PIN_3 | PD_MUX_15) //!< PA3 as SSI0Fss

// GPIO pin A4
#define PD_PA4				(PD_PORT_A | PD_PIN_4 | PD_MUX_0)  //!< PA4
#define PD_PA4_U3Rx         (PD_PORT_A | PD_PIN_4 | PD_MUX_1)  //!< PA4 as U3Rx
#define PD_PA4_I2C7SCL      (PD_PORT_A | PD_PIN_4 | PD_MUX_2)  //!< PA4 as I2C7SCL
#define PD_PA4_T2CCP0       (PD_PORT_A | PD_PIN_4 | PD_MUX_3)  //!< PA4 as T2CCP0
#define PD_PA4_SSI0XDAT0    (PD_PORT_A | PD_PIN_4 | PD_MUX_15) //!< PA4 as SSI0XDAT0

// GPIO pin A5
#define PD_PA5				(PD_PORT_A | PD_PIN_5 | PD_MUX_0)  //!< PA5
#define PD_PA5_U3Tx         (PD_PORT_A | PD_PIN_5 | PD_MUX_1)  //!< PA5 as U3Tx
#define PD_PA5_I2C7SDA      (PD_PORT_A | PD_PIN_5 | PD_MUX_2)  //!< PA5 as I2C7SDA
#define PD_PA5_T2CCP1       (PD_PORT_A | PD_PIN_5 | PD_MUX_3)  //!< PA5 as T2CCP1
#define PD_PA5_SSI0XDAT1    (PD_PORT_A | PD_PIN_5 | PD_MUX_15) //!< PA5 as SSI0XDAT1

// GPIO pin A6
#define PD_PA6				(PD_PORT_A | PD_PIN_6 | PD_MUX_0)  //!< PA6
#define PD_PA6_U2Rx         (PD_PORT_A | PD_PIN_6 | PD_MUX_1)  //!< PA6 as U2Rx
#define PD_PA6_I2C6SCL      (PD_PORT_A | PD_PIN_6 | PD_MUX_2)  //!< PA6 as I2C6SCL
#define PD_PA6_T3CCP0       (PD_PORT_A | PD_PIN_6 | PD_MUX_3)  //!< PA6 as T3CCP0
#define PD_PA6_USB0EPEN     (PD_PORT_A | PD_PIN_6 | PD_MUX_5)  //!< PA6 as USB0EPEN
#define PD_PA6_SSI0XDAT2    (PD_PORT_A | PD_PIN_6 | PD_MUX_13) //!< PA6 as SSI0XDAT2
#define PD_PA6_EPI0S8       (PD_PORT_A | PD_PIN_6 | PD_MUX_15) //!< PA6 as EPI0S8

// GPIO pin A7
#define PD_PA7				(PD_PORT_A | PD_PIN_7 | PD_MUX_0)  //!< PA7
#define PD_PA7_U2Tx         (PD_PORT_A | PD_PIN_7 | PD_MUX_1)  //!< PA7 as U2Tx
#define PD_PA7_I2C6SDA      (PD_PORT_A | PD_PIN_7 | PD_MUX_2)  //!< PA7 as I2C6SDA
#define PD_PA7_T3CCP1       (PD_PORT_A | PD_PIN_7 | PD_MUX_3)  //!< PA7 as T3CCP1
#define PD_PA7_USB0PFLT     (PD_PORT_A | PD_PIN_7 | PD_MUX_5)  //!< PA7 as USB0PFLT
#define PD_PA7_USB0EPEN     (PD_PORT_A | PD_PIN_7 | PD_MUX_11) //!< PA7 as USB0EPEN
#define PD_PA7_SSI0XDAT3    (PD_PORT_A | PD_PIN_7 | PD_MUX_13) //!< PA7 as SSI0XDAT3
#define PD_PA7_EPI0S9       (PD_PORT_A | PD_PIN_7 | PD_MUX_15) //!< PA7 as EPI0S9


// GPIO pin B0
#define PD_PB0				(PD_PORT_B | PD_PIN_0 | PD_MUX_0)  //!< PB0
#define PD_PB0_U1Rx         (PD_PORT_B | PD_PIN_0 | PD_MUX_1)  //!< PB0 as U1Rx
#define PD_PB0_I2C5SCL      (PD_PORT_B | PD_PIN_0 | PD_MUX_2)  //!< PB0 as I2C5SCL
#define PD_PB0_T4CCP0       (PD_PORT_B | PD_PIN_0 | PD_MUX_3)  //!< PB0 as T4CCP0
#define PD_PB0_CAN1Rx       (PD_PORT_B | PD_PIN_0 | PD_MUX_7)  //!< PB0 as CAN1Rx

// GPIO pin B1
#define PD_PB1				(PD_PORT_B | PD_PIN_1 | PD_MUX_0)  //!< PB1
#define PD_PB1_U1Tx         (PD_PORT_B | PD_PIN_1 | PD_MUX_1)  //!< PB1 as U1Tx
#define PD_PB1_I2C5SDA      (PD_PORT_B | PD_PIN_1 | PD_MUX_2)  //!< PB1 as I2C5SDA
#define PD_PB1_T4CCP1       (PD_PORT_B | PD_PIN_1 | PD_MUX_3)  //!< PB1 as T4CCP1
#define PD_PB1_CAN1Tx       (PD_PORT_B | PD_PIN_1 | PD_MUX_7)  //!< PB1 as CAN1Tx

// GPIO pin B2
#define PD_PB2				(PD_PORT_B | PD_PIN_2 | PD_MUX_0)  //!< PB2
#define PD_PB2_I2C0SCL      (PD_PORT_B | PD_PIN_2 | PD_MUX_2)  //!< PB2 as I2C0SCL
#define PD_PB2_T5CCP0       (PD_PORT_B | PD_PIN_2 | PD_MUX_3)  //!< PB2 as T5CCP0
#define PD_PB2_USB0STP      (PD_PORT_B | PD_PIN_2 | PD_MUX_14) //!< PB2 as USB0STP
#define PD_PB2_EPI0S27      (PD_PORT_B | PD_PIN_2 | PD_MUX_15) //!< PB2 as EPI0S27

