miro-kostadinov/tmos/5.05.1.0/hardware/tm4c/gpio_tm4c.h
// GPIO pin B3
#define PD_PB3				(PD_PORT_B | PD_PIN_3 | PD_MUX_0)  //!< PB3
#define PD_PB3_I2C0SDA      (PD_PORT_B | PD_PIN_3 | PD_MUX_2)  //!< PB3 as I2C0SDA
#define PD_PB3_T5CCP1       (PD_PORT_B | PD_PIN_3 | PD_MUX_3)  //!< PB3 as T5CCP1
#define PD_PB3_USB0CLK      (PD_PORT_B | PD_PIN_3 | PD_MUX_14) //!< PB3 as USB0CLK
#define PD_PB3_EPI0S28      (PD_PORT_B | PD_PIN_3 | PD_MUX_15) //!< PB3 as EPI0S28

// GPIO pin B4
#define PD_PB4				(PD_PORT_B | PD_PIN_4 | PD_MUX_0)  //!< PB4
#define PD_PB4_U0CTS        (PD_PORT_B | PD_PIN_4 | PD_MUX_1)  //!< PB4 as U0CTS
#define PD_PB4_I2C5SCL      (PD_PORT_B | PD_PIN_4 | PD_MUX_2)  //!< PB4 as I2C5SCL
#define PD_PB4_SSI1Fss      (PD_PORT_B | PD_PIN_4 | PD_MUX_15) //!< PB4 as SSI1Fss

// GPIO pin B5
#define PD_PB5				(PD_PORT_B | PD_PIN_5 | PD_MUX_0)  //!< PB5
#define PD_PB5_U0RTS        (PD_PORT_B | PD_PIN_5 | PD_MUX_1)  //!< PB5 as U0RTS
#define PD_PB5_I2C5SDA      (PD_PORT_B | PD_PIN_5 | PD_MUX_2)  //!< PB5 as I2C5SDA
#define PD_PB5_SSI1Clk      (PD_PORT_B | PD_PIN_5 | PD_MUX_15) //!< PB5 as SSI1Clk


// GPIO pin C0
#define PD_PC0				(PD_PORT_C | PD_PIN_0 | PD_MUX_0)  //!< PC0
#define PD_PC0_TCK          (PD_PORT_C | PD_PIN_0 | PD_MUX_1)  //!< PC0 as TCK

// GPIO pin C1
#define PD_PC1				(PD_PORT_C | PD_PIN_1 | PD_MUX_0)  //!< PC1
#define PD_PC1_TMS			(PD_PORT_C | PD_PIN_1 | PD_MUX_1)  //!< PC1 as TMS

// GPIO pin C2
#define PD_PC2				(PD_PORT_C | PD_PIN_2 | PD_MUX_0)  //!< PC2
#define PD_PC2_TDI			(PD_PORT_C | PD_PIN_2 | PD_MUX_1)  //!< PC2 as TDI

// GPIO pin C3
#define PD_PC3				(PD_PORT_C | PD_PIN_3 | PD_MUX_0)  //!< PC3
#define PD_PC3_TDO			(PD_PORT_C | PD_PIN_3 | PD_MUX_1)  //!< PC3 as TDO

// GPIO pin C4
#define PD_PC4				(PD_PORT_C | PD_PIN_4 | PD_MUX_0)  //!< PC4
#define PD_PC4_U7Rx         (PD_PORT_C | PD_PIN_4 | PD_MUX_1)  //!< PC4 as U7Rx
#define PD_PC4_EPI0S7       (PD_PORT_C | PD_PIN_4 | PD_MUX_15) //!< PC4 as EPI0S7

// GPIO pin C5
#define PD_PC5				(PD_PORT_C | PD_PIN_5 | PD_MUX_0)  //!< PC5
#define PD_PC5_U7Tx         (PD_PORT_C | PD_PIN_5 | PD_MUX_1)  //!< PC5 as U7Tx
#define PD_PC5_RTCCLK       (PD_PORT_C | PD_PIN_5 | PD_MUX_7)  //!< PC5 as RTCCLK
#define PD_PC5_EPI0S6       (PD_PORT_C | PD_PIN_5 | PD_MUX_15) //!< PC5 as EPI0S6

// GPIO pin C6
#define PD_PC6				(PD_PORT_C | PD_PIN_6 | PD_MUX_0)  //!< PC6
#define PD_PC6_U5Rx         (PD_PORT_C | PD_PIN_6 | PD_MUX_1)  //!< PC6 as U5Rx
#define PD_PC6_EPI0S5       (PD_PORT_C | PD_PIN_6 | PD_MUX_15) //!< PC6 as EPI0S5

// GPIO pin C7
#define PD_PC7				(PD_PORT_C | PD_PIN_7 | PD_MUX_0)  //!< PC7
#define PD_PC7_U5Tx         (PD_PORT_C | PD_PIN_7 | PD_MUX_1)  //!< PC7 as U5Tx
#define PD_PC7_EPI0S4       (PD_PORT_C | PD_PIN_7 | PD_MUX_15) //!< PC7 as EPI0S4


// GPIO pin D0
#define PD_PD0				(PD_PORT_D | PD_PIN_0 | PD_MUX_0)  //!< PD0
#define PD_PD0_I2C7SCL      (PD_PORT_D | PD_PIN_0 | PD_MUX_2)  //!< PD0 as I2C7SCL
#define PD_PD0_T0CCP0       (PD_PORT_D | PD_PIN_0 | PD_MUX_3)  //!< PD0 as T0CCP0
#define PD_PD0_C0o          (PD_PORT_D | PD_PIN_0 | PD_MUX_5)  //!< PD0 as C0o
#define PD_PD0_SSI2XDAT1    (PD_PORT_D | PD_PIN_0 | PD_MUX_15) //!< PD0 as SSI2XDAT1

// GPIO pin D1
#define PD_PD1				(PD_PORT_D | PD_PIN_1 | PD_MUX_0)  //!< PD1
#define PD_PD1_I2C7SDA      (PD_PORT_D | PD_PIN_1 | PD_MUX_2)  //!< PD1 as I2C7SDA
#define PD_PD1_T0CCP1       (PD_PORT_D | PD_PIN_1 | PD_MUX_3)  //!< PD1 as T0CCP1
#define PD_PD1_C1o          (PD_PORT_D | PD_PIN_1 | PD_MUX_5)  //!< PD1 as C1o
#define PD_PD1_SSI2XDAT0    (PD_PORT_D | PD_PIN_1 | PD_MUX_15) //!< PD1 as SSI2XDAT0

// GPIO pin D2
#define PD_PD2				(PD_PORT_D | PD_PIN_2 | PD_MUX_0)  //!< PD2
#define PD_PD2_I2C8SCL      (PD_PORT_D | PD_PIN_2 | PD_MUX_2)  //!< PD2 as I2C8SCL
#define PD_PD2_T1CCP0       (PD_PORT_D | PD_PIN_2 | PD_MUX_3)  //!< PD2 as T1CCP0
#define PD_PD2_C2o          (PD_PORT_D | PD_PIN_2 | PD_MUX_5)  //!< PD2 as C2o
#define PD_PD2_SSI2Fss      (PD_PORT_D | PD_PIN_2 | PD_MUX_15) //!< PD2 as SSI2Fss

// GPIO pin D3
#define PD_PD3				(PD_PORT_D | PD_PIN_3 | PD_MUX_0)  //!< PD3
#define PD_PD3_I2C8SDA      (PD_PORT_D | PD_PIN_3 | PD_MUX_2)  //!< PD3 as I2C8SDA
#define PD_PD3_T1CCP1       (PD_PORT_D | PD_PIN_3 | PD_MUX_3)  //!< PD3 as T1CCP1
#define PD_PD3_SSI2Clk      (PD_PORT_D | PD_PIN_3 | PD_MUX_15) //!< PD3 as SSI2Clk

// GPIO pin D4
#define PD_PD4				(PD_PORT_D | PD_PIN_4 | PD_MUX_0)  //!< PD4
#define PD_PD4_U2Rx         (PD_PORT_D | PD_PIN_4 | PD_MUX_1)  //!< PD4 as U2Rx
#define PD_PD4_T3CCP0       (PD_PORT_D | PD_PIN_4 | PD_MUX_3)  //!< PD4 as T3CCP0
#define PD_PD4_SSI1XDAT2    (PD_PORT_D | PD_PIN_4 | PD_MUX_15) //!< PD4 as SSI1XDAT2

// GPIO pin D5
#define PD_PD5				(PD_PORT_D | PD_PIN_5 | PD_MUX_0)  //!< PD5
#define PD_PD5_U2Tx         (PD_PORT_D | PD_PIN_5 | PD_MUX_1)  //!< PD5 as U2Tx
#define PD_PD5_T3CCP1       (PD_PORT_D | PD_PIN_5 | PD_MUX_3)  //!< PD5 as T3CCP1
#define PD_PD5_SSI1XDAT3    (PD_PORT_D | PD_PIN_5 | PD_MUX_15) //!< PD5 as SSI1XDAT3

// GPIO pin D6
#define PD_PD6				(PD_PORT_D | PD_PIN_6 | PD_MUX_0)  //!< PD6
#define PD_PD6_U2RTS        (PD_PORT_D | PD_PIN_6 | PD_MUX_1)  //!< PD6 as U2RTS
#define PD_PD6_T4CCP0       (PD_PORT_D | PD_PIN_6 | PD_MUX_3)  //!< PD6 as T4CCP0
#define PD_PD6_USB0EPEN     (PD_PORT_D | PD_PIN_6 | PD_MUX_5)  //!< PD6 as USB0EPEN
#define PD_PD6_SSI2XDAT3    (PD_PORT_D | PD_PIN_6 | PD_MUX_15) //!< PD6 as SSI2XDAT3

// GPIO pin D7
#define PD_PD7				(PD_PORT_D | PD_PIN_7 | PD_MUX_0)  //!< PD7
#define PD_PD7_U2CTS        (PD_PORT_D | PD_PIN_7 | PD_MUX_1)  //!< PD7 as U2CTS
#define PD_PD7_T4CCP1       (PD_PORT_D | PD_PIN_7 | PD_MUX_3)  //!< PD7 as T4CCP1
#define PD_PD7_USB0PFLT     (PD_PORT_D | PD_PIN_7 | PD_MUX_5)  //!< PD7 as USB0PFLT
#define PD_PD7_NMI          (PD_PORT_D | PD_PIN_7 | PD_MUX_8)  //!< PD7 as NMI
#define PD_PD7_SSI2XDAT2    (PD_PORT_D | PD_PIN_7 | PD_MUX_15) //!< PD7 as SSI2XDAT2


// GPIO pin E0
#define PD_PE0				(PD_PORT_E | PD_PIN_0 | PD_MUX_0)  //!< PE0
#define PD_PE0_U1RTS        (PD_PORT_E | PD_PIN_0 | PD_MUX_1)  //!< PE0 as U1RTS

// GPIO pin E1
#define PD_PE1				(PD_PORT_E | PD_PIN_1 | PD_MUX_0)  //!< PE1
#define PD_PE1_U1DSR        (PD_PORT_E | PD_PIN_1 | PD_MUX_1)  //!< PE1 as U1DSR

// GPIO pin E2
#define PD_PE2				(PD_PORT_E | PD_PIN_2 | PD_MUX_0)  //!< PE2
#define PD_PE2_U1DCD        (PD_PORT_E | PD_PIN_2 | PD_MUX_1)  //!< PE2 as U1DCD

// GPIO pin E3
#define PD_PE3				(PD_PORT_E | PD_PIN_3 | PD_MUX_0)  //!< PE3
#define PD_PE3_U1DTR        (PD_PORT_E | PD_PIN_3 | PD_MUX_1)  //!< PE3 as U1DTR

