miro-kostadinov/tmos/5.05.1.0/hardware/tm4c/gpio_tm4c.h
// GPIO pin E4
#define PD_PE4				(PD_PORT_E | PD_PIN_4 | PD_MUX_0)  //!< PE4
#define PD_PE4_U1RI         (PD_PORT_E | PD_PIN_4 | PD_MUX_1)  //!< PE4 as U1RI
#define PD_PE4_SSI1XDAT0    (PD_PORT_E | PD_PIN_4 | PD_MUX_15) //!< PE4 as SSI1XDAT0

// GPIO pin E5
#define PD_PE5				(PD_PORT_E | PD_PIN_5 | PD_MUX_0)  //!< PE5
#define PD_PE5_SSI1XDAT1    (PD_PORT_E | PD_PIN_5 | PD_MUX_15) //!< PE5 as SSI1XDAT1


// GPIO pin F0
#define PD_PF0				(PD_PORT_F | PD_PIN_0 | PD_MUX_0)  //!< PF0
#define PD_PF0_EN0LED0      (PD_PORT_F | PD_PIN_0 | PD_MUX_5)  //!< PF0 as EN0LED0
#define PD_PF0_M0PWM0       (PD_PORT_F | PD_PIN_0 | PD_MUX_6)  //!< PF0 as M0PWM0
#define PD_PF0_SSI3XDAT1    (PD_PORT_F | PD_PIN_0 | PD_MUX_14) //!< PF0 as SSI3XDAT1
#define PD_PF0_TRD2         (PD_PORT_F | PD_PIN_0 | PD_MUX_15) //!< PF0 as TRD2

// GPIO pin F1
#define PD_PF1				(PD_PORT_F | PD_PIN_1 | PD_MUX_0)  //!< PF1
#define PD_PF1_EN0LED2      (PD_PORT_F | PD_PIN_1 | PD_MUX_5)  //!< PF1 as EN0LED2
#define PD_PF1_M0PWM1       (PD_PORT_F | PD_PIN_1 | PD_MUX_6)  //!< PF1 as M0PWM1
#define PD_PF1_SSI3XDAT0    (PD_PORT_F | PD_PIN_1 | PD_MUX_14) //!< PF1 as SSI3XDAT0
#define PD_PF1_TRD1         (PD_PORT_F | PD_PIN_1 | PD_MUX_15) //!< PF1 as TRD1

// GPIO pin F2
#define PD_PF2				(PD_PORT_F | PD_PIN_2 | PD_MUX_0)  //!< PF2
#define PD_PF2_M0PWM2       (PD_PORT_F | PD_PIN_2 | PD_MUX_6)  //!< PF2 as M0PWM2
#define PD_PF2_SSI3Fss      (PD_PORT_F | PD_PIN_2 | PD_MUX_14) //!< PF2 as SSI3Fss
#define PD_PF2_TRD0         (PD_PORT_F | PD_PIN_2 | PD_MUX_15) //!< PF2 as TRD0

// GPIO pin F3
#define PD_PF3				(PD_PORT_F | PD_PIN_3 | PD_MUX_0)  //!< PF3
#define PD_PF3_M0PWM3       (PD_PORT_F | PD_PIN_3 | PD_MUX_6)  //!< PF3 as M0PWM3
#define PD_PF3_SSI3Clk      (PD_PORT_F | PD_PIN_3 | PD_MUX_14) //!< PF3 as SSI3Clk
#define PD_PF3_TRCLK        (PD_PORT_F | PD_PIN_3 | PD_MUX_15) //!< PF3 as TRCLK

// GPIO pin F4
#define PD_PF4				(PD_PORT_F | PD_PIN_4 | PD_MUX_0)  //!< PF4
#define PD_PF4_EN0LED1      (PD_PORT_F | PD_PIN_4 | PD_MUX_5)  //!< PF4 as EN0LED1
#define PD_PF4_M0FAULT0     (PD_PORT_F | PD_PIN_4 | PD_MUX_6)  //!< PF4 as M0FAULT0
#define PD_PF4_SSI3XDAT2    (PD_PORT_F | PD_PIN_4 | PD_MUX_14) //!< PF4 as SSI3XDAT2
#define PD_PF4_TRD3	        (PD_PORT_F | PD_PIN_4 | PD_MUX_15) //!< PF4 as TRD3


// GPIO pin G0
#define PD_PG0				(PD_PORT_G | PD_PIN_0 | PD_MUX_0)  //!< PG0
#define PD_PG0_I2C1SCL      (PD_PORT_G | PD_PIN_0 | PD_MUX_2)  //!< PG0 as I2C1SCL
#define PD_PG0_EN0PPS       (PD_PORT_G | PD_PIN_0 | PD_MUX_5)  //!< PG0 as EN0PPS
#define PD_PG0_M0PWM4       (PD_PORT_G | PD_PIN_0 | PD_MUX_6)  //!< PG0 as M0PWM4
#define PD_PG0_EPI0S11      (PD_PORT_G | PD_PIN_0 | PD_MUX_15) //!< PG0 as EPI0S11

// GPIO pin G1
#define PD_PG1				(PD_PORT_G | PD_PIN_1 | PD_MUX_0)  //!< PG1
#define PD_PG1_I2C1SDA      (PD_PORT_G | PD_PIN_1 | PD_MUX_2)  //!< PG1 as I2C1SDA
#define PD_PG1_M0PWM5       (PD_PORT_G | PD_PIN_1 | PD_MUX_6)  //!< PG1 as M0PWM5
#define PD_PG1_EPI0S10      (PD_PORT_G | PD_PIN_1 | PD_MUX_15) //!< PG1 as EPI0S10


// GPIO pin H0
#define PD_PH0				(PD_PORT_H | PD_PIN_0 | PD_MUX_0)  //!< PH0
#define PD_PH0_U0RTS        (PD_PORT_H | PD_PIN_0 | PD_MUX_1)  //!< PH0 as U0RTS
#define PD_PH0_EPI0S0       (PD_PORT_H | PD_PIN_0 | PD_MUX_15) //!< PH0 as EPI0S0

// GPIO pin H1
#define PD_PH1				(PD_PORT_H | PD_PIN_1 | PD_MUX_0)  //!< PH1
#define PD_PH1_U0CTS        (PD_PORT_H | PD_PIN_1 | PD_MUX_1)  //!< PH1 as U0CTS
#define PD_PH1_EPI0S1       (PD_PORT_H | PD_PIN_1 | PD_MUX_15) //!< PH1 as EPI0S1

// GPIO pin H2
#define PD_PH2				(PD_PORT_H | PD_PIN_2 | PD_MUX_0)  //!< PH2
#define PD_PH2_U0DCD        (PD_PORT_H | PD_PIN_2 | PD_MUX_1)  //!< PH2 as U0DCD
#define PD_PH2_EPI0S2       (PD_PORT_H | PD_PIN_2 | PD_MUX_15) //!< PH2 as EPI0S2

// GPIO pin H3
#define PD_PH3				(PD_PORT_H | PD_PIN_3 | PD_MUX_0)  //!< PH3
#define PD_PH3_U0DSR        (PD_PORT_H | PD_PIN_3 | PD_MUX_1)  //!< PH3 as U0DSR
#define PD_PH3_EPI0S3       (PD_PORT_H | PD_PIN_3 | PD_MUX_15) //!< PH3 as EPI0S3


// GPIO pin J0
#define PD_PJ0				(PD_PORT_J | PD_PIN_0 | PD_MUX_0)  //!< PJ0
#define PD_PJ0_U3Rx         (PD_PORT_J | PD_PIN_0 | PD_MUX_1)  //!< PJ0 as U3Rx
#define PD_PJ0_EN0PPS       (PD_PORT_J | PD_PIN_0 | PD_MUX_5)  //!< PJ0 as EN0PPS

// GPIO pin J1
#define PD_PJ1				(PD_PORT_J | PD_PIN_1 | PD_MUX_0)  //!< PJ1
#define PD_PJ1_U3Tx         (PD_PORT_J | PD_PIN_1 | PD_MUX_1)  //!< PJ1 as U3Tx


// GPIO pin K0
#define PD_PK0				(PD_PORT_K | PD_PIN_0 | PD_MUX_0)  //!< PK0
#define PD_PK0_U4Rx			(PD_PORT_K | PD_PIN_0 | PD_MUX_1)  //!< PK0 as U4Rx
#define PD_PK0_EPI0S0		(PD_PORT_K | PD_PIN_0 | PD_MUX_15) //!< PK0 as EPI0S0

// GPIO pin K1
#define PD_PK1				(PD_PORT_K | PD_PIN_1 | PD_MUX_0)  //!< PK1
#define PD_PK1_U4Tx			(PD_PORT_K | PD_PIN_1 | PD_MUX_1)  //!< PK1 as U4Tx
#define PD_PK1_EPI0S1		(PD_PORT_K | PD_PIN_1 | PD_MUX_15) //!< PK1 as EPI0S1

// GPIO pin K2
#define PD_PK2				(PD_PORT_K | PD_PIN_2 | PD_MUX_0)  //!< PK2
#define PD_PK2_U4RTS		(PD_PORT_K | PD_PIN_2 | PD_MUX_1)  //!< PK2 as U4RTS
#define PD_PK2_EPI0S2		(PD_PORT_K | PD_PIN_2 | PD_MUX_15) //!< PK2 as EPI0S2

// GPIO pin K3
#define PD_PK3				(PD_PORT_K | PD_PIN_3 | PD_MUX_0)  //!< PK3
#define PD_PK3_U4CTS		(PD_PORT_K | PD_PIN_3 | PD_MUX_1)  //!< PK3 as U4CTS
#define PD_PK3_EPI0S3		(PD_PORT_K | PD_PIN_3 | PD_MUX_15) //!< PK3 as EPI0S3

// GPIO pin K4
#define PD_PK4				(PD_PORT_K | PD_PIN_4 | PD_MUX_0)  //!< PK4
#define PD_PK4_I2C3SCL		(PD_PORT_K | PD_PIN_4 | PD_MUX_2)  //!< PK4 as I2C3SCL
#define PD_PK4_EN0LED0		(PD_PORT_K | PD_PIN_4 | PD_MUX_5)  //!< PK4 as EN0LED0
#define PD_PK4_M0PWM6		(PD_PORT_K | PD_PIN_4 | PD_MUX_6)  //!< PK4 as M0PWM6
#define PD_PK4_EPI0S32		(PD_PORT_K | PD_PIN_4 | PD_MUX_15) //!< PK4 as EPI0S32

// GPIO pin K5
#define PD_PK5				(PD_PORT_K | PD_PIN_5 | PD_MUX_0)  //!< PK5
#define PD_PK5_I2C3SDA		(PD_PORT_K | PD_PIN_5 | PD_MUX_2)  //!< PK5 as I2C3SDA
#define PD_PK5_EN0LED2		(PD_PORT_K | PD_PIN_5 | PD_MUX_5)  //!< PK5 as EN0LED2
#define PD_PK5_M0PWM7		(PD_PORT_K | PD_PIN_5 | PD_MUX_6)  //!< PK5 as M0PWM7
#define PD_PK5_EPI0S31		(PD_PORT_K | PD_PIN_5 | PD_MUX_15) //!< PK5 as EPI0S31

// GPIO pin K6
#define PD_PK6				(PD_PORT_K | PD_PIN_6 | PD_MUX_0)  //!< PK6
#define PD_PK6_I2C4SCL		(PD_PORT_K | PD_PIN_6 | PD_MUX_2)  //!< PK6 as I2C4SCL
#define PD_PK6_EN0LED1		(PD_PORT_K | PD_PIN_6 | PD_MUX_5)  //!< PK6 as EN0LED1
#define PD_PK6_M0FAULT1		(PD_PORT_K | PD_PIN_6 | PD_MUX_6)  //!< PK6 as M0FAULT1
#define PD_PK6_EPI0S25		(PD_PORT_K | PD_PIN_6 | PD_MUX_15) //!< PK6 as EPI0S25

