miro-kostadinov/tmos/5.05.1.0/hardware/tm4c/gpio_tm4c.h
// GPIO pin K7
#define PD_PK7				(PD_PORT_K | PD_PIN_7 | PD_MUX_0)  //!< PK7
#define PD_PK7_U0RI			(PD_PORT_K | PD_PIN_7 | PD_MUX_1)  //!< PK7 as U0RI
#define PD_PK7_I2C4SDA		(PD_PORT_K | PD_PIN_7 | PD_MUX_2)  //!< PK7 as I2C4SDA
#define PD_PK7_RTCCLK		(PD_PORT_K | PD_PIN_7 | PD_MUX_5)  //!< PK7 as RTCCLK
#define PD_PK7_M0FAULT2		(PD_PORT_K | PD_PIN_7 | PD_MUX_6)  //!< PK7 as M0FAULT2
#define PD_PK7_EPI0S24		(PD_PORT_K | PD_PIN_7 | PD_MUX_15) //!< PK7 as EPI0S24


// GPIO pin L0
#define PD_PL0				(PD_PORT_L | PD_PIN_0 | PD_MUX_0)  //!< PL0
#define PD_PL0_I2C2SDA		(PD_PORT_L | PD_PIN_0 | PD_MUX_2)  //!< PL0 as I2C2SDA
#define PD_PL0_M0FAULT3		(PD_PORT_L | PD_PIN_0 | PD_MUX_6)  //!< PL0 as M0FAULT3
#define PD_PL0_USB0D0		(PD_PORT_L | PD_PIN_0 | PD_MUX_14) //!< PL0 as USB0D0
#define PD_PL0_EPI0S16		(PD_PORT_L | PD_PIN_0 | PD_MUX_15) //!< PL0 as EPI0S16

// GPIO pin L1
#define PD_PL1				(PD_PORT_L | PD_PIN_1 | PD_MUX_0)  //!< PL1
#define PD_PL1_I2C2SCL		(PD_PORT_L | PD_PIN_1 | PD_MUX_2)  //!< PL1 as I2C2SCL
#define PD_PL1_PhA0			(PD_PORT_L | PD_PIN_1 | PD_MUX_6)  //!< PL1 as PhA0
#define PD_PL1_USB0D1		(PD_PORT_L | PD_PIN_1 | PD_MUX_14) //!< PL1 as USB0D1
#define PD_PL1_EPI0S17		(PD_PORT_L | PD_PIN_1 | PD_MUX_15) //!< PL1 as EPI0S17

// GPIO pin L2
#define PD_PL2				(PD_PORT_L | PD_PIN_2 | PD_MUX_0)  //!< PL2
#define PD_PL2_C0o			(PD_PORT_L | PD_PIN_2 | PD_MUX_5)  //!< PL2 as C0o
#define PD_PL2_PhB0			(PD_PORT_L | PD_PIN_2 | PD_MUX_6)  //!< PL2 as PhB0
#define PD_PL2_USB0D2		(PD_PORT_L | PD_PIN_2 | PD_MUX_14) //!< PL2 as USB0D2
#define PD_PL2_EPI0S18		(PD_PORT_L | PD_PIN_2 | PD_MUX_15) //!< PL2 as EPI0S18

// GPIO pin L3
#define PD_PL3				(PD_PORT_L | PD_PIN_3 | PD_MUX_0)  //!< PL3
#define PD_PL3_C1o			(PD_PORT_L | PD_PIN_3 | PD_MUX_5)  //!< PL3 as C1o
#define PD_PL3_IDX0			(PD_PORT_L | PD_PIN_3 | PD_MUX_6)  //!< PL3 as IDX0
#define PD_PL3_USB0D3		(PD_PORT_L | PD_PIN_3 | PD_MUX_14) //!< PL3 as USB0D3
#define PD_PL3_EPI0S19		(PD_PORT_L | PD_PIN_3 | PD_MUX_15) //!< PL3 as EPI0S19

// GPIO pin L4
#define PD_PL4				(PD_PORT_L | PD_PIN_4 | PD_MUX_0)  //!< PL4
#define PD_PL4_T0CCP0		(PD_PORT_L | PD_PIN_4 | PD_MUX_3)  //!< PL4 as T0CCP0
#define PD_PL4_USB0D4		(PD_PORT_L | PD_PIN_4 | PD_MUX_14) //!< PL4 as USB0D4
#define PD_PL4_EPI0S26		(PD_PORT_L | PD_PIN_4 | PD_MUX_15) //!< PL4 as EPI0S26

// GPIO pin L5
#define PD_PL5				(PD_PORT_L | PD_PIN_5 | PD_MUX_0)  //!< PL5
#define PD_PL5_T0CCP1		(PD_PORT_L | PD_PIN_5 | PD_MUX_3)  //!< PL5 as T0CCP1
#define PD_PL5_USB0D5		(PD_PORT_L | PD_PIN_5 | PD_MUX_14) //!< PL5 as USB0D5
#define PD_PL5_EPI0S33		(PD_PORT_L | PD_PIN_5 | PD_MUX_15) //!< PL5 as EPI0S33

// GPIO pin L6
#define PD_PL6				(PD_PORT_L | PD_PIN_6 | PD_MUX_0)  //!< PL6
#define PD_PL6_T1CCP0		(PD_PORT_L | PD_PIN_6 | PD_MUX_3)  //!< PL6 as T1CCP0

// GPIO pin L7
#define PD_PL7				(PD_PORT_L | PD_PIN_7 | PD_MUX_0)  //!< PL7
#define PD_PL7_T1CCP1		(PD_PORT_L | PD_PIN_7 | PD_MUX_3)  //!< PL7 as T1CCP1



// GPIO pin M0
#define PD_PM0				(PD_PORT_M | PD_PIN_0 | PD_MUX_0)  //!< PM0
#define PD_PM0_T2CCP0		(PD_PORT_M | PD_PIN_0 | PD_MUX_3)  //!< PM0 as T2CCP0
#define PD_PM0_EPI0S15		(PD_PORT_M | PD_PIN_0 | PD_MUX_15) //!< PM0 as EPI0S15

// GPIO pin M1
#define PD_PM1				(PD_PORT_M | PD_PIN_1 | PD_MUX_0)  //!< PM1
#define PD_PM1_T2CCP1		(PD_PORT_M | PD_PIN_1 | PD_MUX_3)  //!< PM1 as T2CCP1
#define PD_PM1_EPI0S14		(PD_PORT_M | PD_PIN_1 | PD_MUX_15) //!< PM1 as EPI0S14

// GPIO pin M2
#define PD_PM2				(PD_PORT_M | PD_PIN_2 | PD_MUX_0)  //!< PM2
#define PD_PM2_T3CCP0		(PD_PORT_M | PD_PIN_2 | PD_MUX_3)  //!< PM2 as T3CCP0
#define PD_PM2_EPI0S13		(PD_PORT_M | PD_PIN_2 | PD_MUX_15) //!< PM2 as EPI0S13

// GPIO pin M3
#define PD_PM3				(PD_PORT_M | PD_PIN_3 | PD_MUX_0)  //!< PM3
#define PD_PM3_T3CCP1		(PD_PORT_M | PD_PIN_3 | PD_MUX_3)  //!< PM3 as T3CCP1
#define PD_PM3_EPI0S12		(PD_PORT_M | PD_PIN_3 | PD_MUX_15) //!< PM3 as EPI0S12

// GPIO pin M4
#define PD_PM4				(PD_PORT_M | PD_PIN_4 | PD_MUX_0)  //!< PM4
#define PD_PM4_U0CTS		(PD_PORT_M | PD_PIN_4 | PD_MUX_1)  //!< PM4 as U0CTS
#define PD_PM4_T4CCP0		(PD_PORT_M | PD_PIN_4 | PD_MUX_3)  //!< PM4 as T4CCP0

// GPIO pin M5
#define PD_PM5				(PD_PORT_M | PD_PIN_5 | PD_MUX_0)  //!< PM5
#define PD_PM5_U0DCD		(PD_PORT_M | PD_PIN_5 | PD_MUX_1)  //!< PM5 as U0DCD
#define PD_PM5_T4CCP1		(PD_PORT_M | PD_PIN_5 | PD_MUX_3)  //!< PM5 as T4CCP1

// GPIO pin M6
#define PD_PM6				(PD_PORT_M | PD_PIN_6 | PD_MUX_0)  //!< PM6
#define PD_PM6_U0DSR		(PD_PORT_M | PD_PIN_6 | PD_MUX_1)  //!< PM6 as U0DSR
#define PD_PM6_T5CCP0		(PD_PORT_M | PD_PIN_6 | PD_MUX_3)  //!< PM6 as T5CCP0

// GPIO pin M7
#define PD_PM7				(PD_PORT_M | PD_PIN_7 | PD_MUX_0)  //!< PM7
#define PD_PM7_U0RI			(PD_PORT_M | PD_PIN_7 | PD_MUX_1)  //!< PM7 as U0RI
#define PD_PM7_T5CCP1		(PD_PORT_M | PD_PIN_7 | PD_MUX_3)  //!< PM7 as T5CCP1



// GPIO pin N0
#define PD_PN0				(PD_PORT_N | PD_PIN_0 | PD_MUX_0)  //!< PN0
#define PD_PN0_U1RTS		(PD_PORT_N | PD_PIN_0 | PD_MUX_1)  //!< PN0 as U1RTS

// GPIO pin N1
#define PD_PN1				(PD_PORT_N | PD_PIN_1 | PD_MUX_0)  //!< PN1
#define PD_PN1_U1CTS		(PD_PORT_N | PD_PIN_1 | PD_MUX_1)  //!< PN1 as U1CTS

// GPIO pin N2
#define PD_PN2				(PD_PORT_N | PD_PIN_2 | PD_MUX_0)  //!< PN2
#define PD_PN2_U1DCD		(PD_PORT_N | PD_PIN_2 | PD_MUX_1)  //!< PN2 as U1DCD
#define PD_PN2_U2RTS		(PD_PORT_N | PD_PIN_2 | PD_MUX_2)  //!< PN2 as U2RTS
#define PD_PN2_EPI0S29		(PD_PORT_N | PD_PIN_2 | PD_MUX_15) //!< PN2 as EPI0S29

// GPIO pin N3
#define PD_PN3				(PD_PORT_N | PD_PIN_3 | PD_MUX_0)  //!< PN3
#define PD_PN3_U1DSR		(PD_PORT_N | PD_PIN_3 | PD_MUX_1)  //!< PN3 as U1DSR
#define PD_PN3_U2CTS		(PD_PORT_N | PD_PIN_3 | PD_MUX_2)  //!< PN3 as U2CTS
#define PD_PN3_EPI0S30		(PD_PORT_N | PD_PIN_3 | PD_MUX_15) //!< PN3 as EPI0S30

// GPIO pin N4
#define PD_PN4				(PD_PORT_N | PD_PIN_4 | PD_MUX_0)  //!< PN4
#define PD_PN4_U1DTR		(PD_PORT_N | PD_PIN_4 | PD_MUX_1)  //!< PN4 as U1DTR
#define PD_PN4_U3RTS		(PD_PORT_N | PD_PIN_4 | PD_MUX_2)  //!< PN4 as U3RTS
#define PD_PN4_I2C2SDA		(PD_PORT_N | PD_PIN_4 | PD_MUX_3)  //!< PN4 as I2C2SDA
#define PD_PN4_EPI0S34		(PD_PORT_N | PD_PIN_4 | PD_MUX_15) //!< PN4 as EPI0S34

// GPIO pin N5
#define PD_PN5				(PD_PORT_N | PD_PIN_5 | PD_MUX_0)  //!< PN5
#define PD_PN5_U1RI			(PD_PORT_N | PD_PIN_5 | PD_MUX_1)  //!< PN5 as U1RI
#define PD_PN5_U3CTS		(PD_PORT_N | PD_PIN_5 | PD_MUX_2)  //!< PN5 as U3CTS
#define PD_PN5_I2C2SCL		(PD_PORT_N | PD_PIN_5 | PD_MUX_3)  //!< PN5 as I2C2SCL
#define PD_PN5_EPI0S35		(PD_PORT_N | PD_PIN_5 | PD_MUX_15) //!< PN5 as EPI0S35


// GPIO pin P0
#define PD_PP0				(PD_PORT_P | PD_PIN_0 | PD_MUX_0)  //!< PP0
#define PD_PP0_U6Rx			(PD_PORT_P | PD_PIN_0 | PD_MUX_1)  //!< PP0 as U6Rx
#define PD_PP0_SSI3XDAT2	(PD_PORT_P | PD_PIN_0 | PD_MUX_15) //!< PP0 as SSI3XDAT2

// GPIO pin P1
#define PD_PP1				(PD_PORT_P | PD_PIN_1 | PD_MUX_0)  //!< PP1
#define PD_PP1_U6Tx			(PD_PORT_P | PD_PIN_1 | PD_MUX_1)  //!< PP1 as U6Tx
#define PD_PP1_SSI3XDAT3	(PD_PORT_P | PD_PIN_1 | PD_MUX_15) //!< PP1 as SSI3XDAT3

// GPIO pin P2
#define PD_PP2				(PD_PORT_P | PD_PIN_2 | PD_MUX_0)  //!< PP2
#define PD_PP2_U0DTR		(PD_PORT_P | PD_PIN_2 | PD_MUX_1)  //!< PP2 as U0DTR
#define PD_PP2_USB0NXT		(PD_PORT_P | PD_PIN_2 | PD_MUX_14) //!< PP2 as USB0NXT
#define PD_PP2_EPI0S29		(PD_PORT_P | PD_PIN_2 | PD_MUX_15) //!< PP2 as EPI0S29

// GPIO pin P3
#define PD_PP3				(PD_PORT_P | PD_PIN_3 | PD_MUX_0)  //!< PP3
#define PD_PP3_U1CTS		(PD_PORT_P | PD_PIN_3 | PD_MUX_1)  //!< PP3 as U1CTS
#define PD_PP3_U0DCD		(PD_PORT_P | PD_PIN_3 | PD_MUX_2)  //!< PP3 as U0DCD
#define PD_PP3_RTCCLK		(PD_PORT_P | PD_PIN_3 | PD_MUX_7)  //!< PP3 as RTCCLK
#define PD_PP3_USB0DIR		(PD_PORT_P | PD_PIN_3 | PD_MUX_14) //!< PP3 as USB0DIR
#define PD_PP3_EPI0S30		(PD_PORT_P | PD_PIN_3 | PD_MUX_15) //!< PP3 as EPI0S30

