miro-kostadinov/tmos/5.05.1.0/hardware/tm4c/gpio_tm4c.h
// GPIO pin P4
#define PD_PP4				(PD_PORT_P | PD_PIN_4 | PD_MUX_0)  //!< PP4
#define PD_PP4_U3RTS		(PD_PORT_P | PD_PIN_4 | PD_MUX_1)  //!< PP4 as U3RTS
#define PD_PP4_U0DSR		(PD_PORT_P | PD_PIN_4 | PD_MUX_2)  //!< PP4 as U0DSR
#define PD_PP4_USB0D7		(PD_PORT_P | PD_PIN_4 | PD_MUX_14) //!< PP4 as USB0D7

// GPIO pin P5
#define PD_PP5				(PD_PORT_P | PD_PIN_5 | PD_MUX_0)  //!< PP5
#define PD_PP5_U3CTS		(PD_PORT_P | PD_PIN_5 | PD_MUX_1)  //!< PP5 as U3CTS
#define PD_PP5_I2C2SCL		(PD_PORT_P | PD_PIN_5 | PD_MUX_2)  //!< PP5 as I2C2SCL
#define PD_PP5_USB0D6		(PD_PORT_P | PD_PIN_5 | PD_MUX_14) //!< PP5 as USB0D6


// GPIO pin Q0
#define PD_PQ0				(PD_PORT_Q | PD_PIN_0 | PD_MUX_0)  //!< PQ0
#define PD_PQ0_SSI3Clk		(PD_PORT_Q | PD_PIN_0 | PD_MUX_14) //!< PQ0 as SSI3Clk
#define PD_PQ0_EPI0S20		(PD_PORT_Q | PD_PIN_0 | PD_MUX_15) //!< PQ0 as EPI0S20

// GPIO pin Q1
#define PD_PQ1				(PD_PORT_Q | PD_PIN_1 | PD_MUX_0)  //!< PQ1
#define PD_PQ1_SSI3Fss		(PD_PORT_Q | PD_PIN_1 | PD_MUX_14) //!< PQ1 as SSI3Fss
#define PD_PQ1_EPI0S21		(PD_PORT_Q | PD_PIN_1 | PD_MUX_15) //!< PQ1 as EPI0S21

// GPIO pin Q2
#define PD_PQ2				(PD_PORT_Q | PD_PIN_2 | PD_MUX_0)  //!< PQ2
#define PD_PQ2_SSI3XDAT0	(PD_PORT_Q | PD_PIN_2 | PD_MUX_14) //!< PQ2 as SSI3XDAT0
#define PD_PQ2_EPI0S22		(PD_PORT_Q | PD_PIN_2 | PD_MUX_15) //!< PQ2 as EPI0S22

// GPIO pin Q3
#define PD_PQ3				(PD_PORT_Q | PD_PIN_3 | PD_MUX_0)  //!< PQ3
#define PD_PQ3_SSI3XDAT1	(PD_PORT_Q | PD_PIN_3 | PD_MUX_14) //!< PQ3 as SSI3XDAT1
#define PD_PQ3_EPI0S23		(PD_PORT_Q | PD_PIN_3 | PD_MUX_15) //!< PQ3 as EPI0S23

// GPIO pin Q4
#define PD_PQ4				(PD_PORT_Q | PD_PIN_4 | PD_MUX_0)  //!< PQ4
#define PD_PQ4_U1Rx			(PD_PORT_Q | PD_PIN_4 | PD_MUX_1)  //!< PQ4 as U1Rx
#define PD_PQ4_DIVSCLK		(PD_PORT_Q | PD_PIN_4 | PD_MUX_7)  //!< PQ4 as DIVSCLK



// Combined flags for pin definitions
#define PD_STRENGTH_8MA_SC  (PD_STRENGTH_8MA | PD_SLEW_RATE)  //!< 8mA drive with slew rate

#define PD_IN				(PD_INPUT | PD_STRENGTH_2MA | PD_PUSH_PULL) //!< input pin
#define PD_OUT				(PD_OUTPUT| PD_STRENGTH_2MA | PD_PUSH_PULL) //!< output pin
#define PD_OUT_8MA			(PD_OUTPUT| PD_STRENGTH_8MA | PD_PUSH_PULL) //!< output pin 8mA drive
#define PD_OD				(PD_OUTPUT| PD_STRENGTH_2MA | PD_MODE_OD)	//!< open drain pin
#define PD_OD_8MA			(PD_OUTPUT| PD_STRENGTH_8MA | PD_MODE_OD)	//!< open drain 8mA drive

#define PD_PERIPHERAL		(PD_AFSEL | PD_STRENGTH_2MA | PD_PUSH_PULL)	//!< peripheral pin
#define PD_PERIPHERAL_8MA 	(PD_AFSEL | PD_STRENGTH_8MA | PD_PUSH_PULL)	//!< peripheral pin 8mA
#define PD_PERIPHERAL_OD 	(PD_AFSEL | PD_STRENGTH_2MA | PD_MODE_OD)	//!< peripheral open drain
#define PD_PERIPHERAL_8MA_SC (PD_AFSEL | PD_STRENGTH_8MA_SC | PD_PUSH_PULL) //!< peripheral pin 8mA slew rate

#define PD_PIN_COMP			(PD_INPUT | PD_STRENGTH_2MA | PD_MODE_ANALOG) //!< compartor pin
#define PD_USB_ANALOG		(PD_INPUT | PD_STRENGTH_2MA | PD_MODE_ANALOG) //!< usb analog pin

#define PD_ADC				(PD_AFSEL | PD_STRENGTH_2MA | PD_MODE_ANALOG) //!< adc pin
#define PD_UART				(PD_PERIPHERAL)					  //!< uart pin
#define PD_I2C				(PD_PERIPHERAL_OD | PD_PULL_UP)   //!< I2C pin
#define PD_PWM				(PD_PERIPHERAL)					  //!< PWM pin
#define PD_SSI				(PD_PERIPHERAL)					  //!< SSI pin
#define PD_CAN				(PD_PERIPHERAL_8MA)				  //!< CAN pin

/// Calculate port address for a given pin definition
#define PORT_ADDRESS(num) ((GPIO_TypeDef*)(BASE_AHB_GPIOA + ((num)<<12)))


/** @} */ // @STD_GPIO



void PIO_Cfg(PIN_DESC cfg);
void PIO_Cfg_List(const PIN_DESC* list );
void PIO_CfgInput_List(PIN_DESC * list );
void PIO_Free(PIN_DESC cfg);
void PIO_Free_List(PIN_DESC* list);
void PIO_Write(PIN_DESC pins, unsigned int val);
pio_set PIO_Read(PIN_DESC pins);
void PIO_SetOutput(PIN_DESC pins);
void PIO_ClrOutput(PIN_DESC pins);
void PIO_CfgOutput1(PIN_DESC pins);
void PIO_CfgOutput0(PIN_DESC pins);
void PIO_Assert(PIN_DESC pins);
void PIO_Deassert(PIN_DESC pins);
void PIO_CfgInput(PIN_DESC pins);

#endif /* GPIO_TM4C_H_ */
